src/cf/Documents/ПроизводствоМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПроизводствоМП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваровМП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварыМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпецификацииМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварыМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ОстаткиТоваровМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровМП</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТоварныеОперацииМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныПоставщиковМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиковМП</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументПоставки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходТовараМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыТоваровМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыТоваровМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТоварныеОперацииМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТоварныеОперацииМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ПроизводствоМП/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТоваровМП.Записывать = Истина;
	
	КонтролироватьОстатки = НЕ Константы.НеКонтролироватьОстаткиМП.Получить()
		И НЕ ДополнительныеСвойства.Свойство("НеКонтролироватьОстатки");
		
	// Движения по регистру ОстаткиТоваров Расход.
	Если КонтролироватьОстатки Тогда
		Остатки = РегистрыНакопления.ОстаткиТоваровМП.Остатки();
		ТаблицаМатериалов = Материалы.Выгрузить(, "Товар, Количество, Сумма");
		ТаблицаМатериалов.Свернуть("Товар", "Количество, Сумма");
	Иначе
		ТаблицаМатериалов = Материалы;
	КонецЕсли;
	
	Для каждого ТекСтрокаТовары Из ТаблицаМатериалов Цикл
		
		Если ТекСтрокаТовары.Товар.Вид = Перечисления.ВидыТоваровМП.Товар Тогда
			
			Если КонтролироватьОстатки Тогда
				НайденнаяСтрокаОстатков = Остатки.Найти(ТекСтрокаТовары.Товар, "Товар");
				Если НайденнаяСтрокаОстатков = Неопределено Тогда
					КоличествоНаСкладе = 0;
				Иначе
					КоличествоНаСкладе = НайденнаяСтрокаОстатков.Количество;
				КонецЕсли;
				Если КоличествоНаСкладе < ТекСтрокаТовары.Количество Тогда
					СтрокаОшибки = НСтр("ru='На складе нет достаточного количества остатков товара:"
					"%Товар%. Не хватает %Количество%';en='In stock do not have enough residual item:"
					"%Товар%. Not enough %Количество%'");
					СтрокаОшибки = СтрЗаменить(СтрокаОшибки, "%Товар%", СокрЛП(ТекСтрокаТовары.Товар));
					СтрокаОшибки = СтрЗаменить(СтрокаОшибки, "%Количество%", СокрЛП(ТекСтрокаТовары.Количество - КоличествоНаСкладе));
					ОбщегоНазначенияМПКлиентСервер.СообщитьПользователю(СтрокаОшибки, , Отказ);
					Продолжить;
				КонецЕсли
			КонецЕсли;
			
			Движение = Движения.ОстаткиТоваровМП.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Операция = Перечисления.ТоварныеОперацииМП.Производство;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Движения по регистру ОстаткиТоваров Приход.
	Для каждого ТекСтрокаТовары Из Продукция Цикл
		
		Если ТекСтрокаТовары.Товар.Вид = Перечисления.ВидыТоваровМП.Товар Тогда
			
			Движение = Движения.ОстаткиТоваровМП.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Товар = ТекСтрокаТовары.Товар;
			Движение.Количество = ТекСтрокаТовары.Количество;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Операция = Перечисления.ТоварныеОперацииМП.Производство;
			
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.ЦеныПоставщиковМП.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Товар = ТекСтрокаТовары.Товар;
		НоваяЗапись.Цена = ТекСтрокаТовары.Цена;
		НоваяЗапись.Записать(Истина);
		
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	СуммаДокумента = Продукция.Итог("Сумма");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Комментарий = "";
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
